Tutorial/acousticStreamingFoam/USDC_2D/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 1;

boundaryField
{

    "wall.*"
    {
        type            zeroGradient; 
    }

    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            zeroGradient; 
    }

    wall_cathode       
    {
        type            fixedValue;
        value           uniform 0;  
    } 
   
    wall_Anode
    {  
    	type            zeroGradient;
    }
    
    frontAndBack
    {
        type	    empty;
    }
   
}

// ************************************************************************* //
