Tutorial/acousticStreamingFoam/USDC_2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UInitial    (0 0 0.1);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $UInitial;

boundaryField
{
    "wall.*"
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform $UInitial;
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type	    empty;
    }
}

// ************************************************************************ //
