Tutorial/acousticStreamingFoam/USDC_2D/0/ap
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ap;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    "wall.*"
    {
        //type            zeroGradient;
        type	    calculated;
        value	    $internalField;
    }

    inlet
    {
        type	    calculated;
        value	    $internalField;
    }

    outlet
    {
        type	    calculated;
        value	    $internalField;
    }

    frontAndBack
    {
        type	    empty;
    }
}

// ************************************************************************* //
