Tutorial/acousticStreamingFoam/USDC_2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInitial        0.1;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInitial;

boundaryField
{
    "wall.*"
    {
        type            kLowReWallFunction;//kqRWallFunction;
        value           $internalField;//uniform 0;//
    }

    inlet
    {
        type            fixedValue;
        value           uniform $kInitial;
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type	    empty;
    }
}

// ************************************************************************* //
