Tutorial/acousticStreamingFoam/USDC_2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInitial    100;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInitial;

boundaryField
{
    "wall.*"
    {
	type            omegaWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;//uniform $omegaInitial;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type	    empty;
    }
}

// ************************************************************************* //
