Tutorial/acousticStreamingFoam/USDC_2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100;

boundaryField
{

    "wall.*"
    {
        //type            fixedFluxPressure;
        //gradient        $internalField;
        //value           $internalField;
        type            zeroGradient;
    }

    inlet
    {
        /*type            fixedFluxPressure;
        gradient        $internalField;
        value           $internalField;*/
        type            zeroGradient;
    }

    outlet
    {
        /*type            fixedValue;
        value           $internalField;*/
        type            fixedValue;
        value           uniform 100;
    }

    frontAndBack
    {
        type	    empty;
    }
}

// ************************************************************************* //
