Tutorial/acousticStreamingFoam/USDC_2D/0/wallFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 -1 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform -0;
    }
    outlet
    {
        type            calculated;
        value           uniform -0;
    }
    wall_anode
    {
        type            calculated;
        value           uniform -0;
    }
    wall_cathode
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
3.18594255543e-05
3.18594255543e-05
3.18594255543e-05
3.18594255543e-05
3.18594255543e-05
3.18594255543e-05
3.18594255543e-05
3.18594255543e-05
...
)
;
    }
    wall_isolation
    {
        type            calculated;
        value           uniform -0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
