Tutorial/acousticStreamingFoam/USDC_2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu	[ 0  2 -1 0 0 0 0 ] 1.3e-06;

Dmol	[ 0 2 -1 0 0 0 0 ] 8e-10;
Sct	[ 0 0 0 0 0 0 0 ] 0.5;

// Acoustic properties
omega_f [ 0  0 -1 0 0 0 0 ] 251327;//40 kHz

c	[ 0  1 -1 0 0 0 0 ] 1481;
rho	[ 1 -3  0 0 0 0 0 ] 1000;
A	[ 1 -3 -2 0 0 0 0 ] 0;//1.0e+04;
B	[ 1 -3 -2 0 0 0 0 ] 0;//6.32e+7;


// ************************************************************************* //
