Tutorial/acousticStreamingFoam/USDC_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     acousticStreamingFoam;

ultrasound 	true; // true-false

// startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;
// stopAt          writeNow;

endTime         20.0;

deltaT          1e-3;

// writeControl    timeStep;
writeControl    adjustableRunTime;

// writeInterval   8;
writeInterval   1;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  12;

writeCompression off;//uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;
//adjustTimeStep  no;

maxCo           1;
// maxDeltaT       1;



// ************************************************************************* //
